In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4, 7, -5, 3])
print (obj)
print (obj.values, type(obj.values))
print (obj.index, type(obj.index))

0    4
1    7
2   -5
3    3
dtype: int64
[ 4  7 -5  3] <class 'numpy.ndarray'>
RangeIndex(start=0, stop=4, step=1) <class 'pandas.core.indexes.range.RangeIndex'>

In [3]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print (obj2.index)
print ("----")
print (obj2['a'])
print ("----")
print (obj2[['c', 'a']])

Index(['d', 'b', 'a', 'c'], dtype='object')
----
-5
----
c    3
a   -5
dtype: int64

In [4]:
print (obj2)
print ("----")
print (obj2 > 0)
print ("----")
print (obj2[obj2 > 0])
print ("----")
print (obj2*2)
np.exp(obj2)

d    4
b    7
a   -5
c    3
dtype: int64
----
d     True
b     True
a    False
c     True
dtype: bool
----
d    4
b    7
c    3
dtype: int64
----
d     8
b    14
a   -10
c     6
dtype: int64

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [5]:
sdata = {'Ohio' : 35000, 'Texas' : 71000, 'Oregon': 16000, 'Utah' : 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [6]:
## Dataframe

data = {'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year'  : [2000, 2001, 2002, 2001, 2002, 2003],
        'pop'   : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
print (frame.head())
print ("----")
f2 = pd.DataFrame(data, columns = ['year', 'state', 'pop'])
print (f2)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
----
   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [7]:
frame2 = pd.DataFrame(data, 
                      columns = ['year', 'state', 'pop', 'debt'], 
                      index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [8]:
print(frame2.columns, type(frame2.columns))
print(frame2.index, type(frame2.index))

Index(['year', 'state', 'pop', 'debt'], dtype='object') <class 'pandas.core.indexes.base.Index'>
Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object') <class 'pandas.core.indexes.base.Index'>

In [9]:
frame2['year']
frame2.state
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [10]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [11]:
frame2['debt'] = np.arange(6)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [12]:
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2003  Nevada  3.2     5    False

In [13]:
frame2.columns
##del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [14]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9},
        'Ohio'  : {2000 : 1.5, 2001 : 1.6, 2002 : 3.6}
      }
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.6
2002     2.9   3.6
2000     NaN   1.5

In [15]:
frame2.T

          one   two three    four    five     six
year     2000  2001  2002    2001    2002    2003
state    Ohio  Ohio  Ohio  Nevada  Nevada  Nevada
pop       1.5   1.7   3.6     2.4     2.9     3.2
debt        0     1     2       3       4       5
eastern  True  True  True   False   False   False

In [16]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.6   3.6   1.5

In [17]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.6
2002     2.9   3.6
2003     NaN   NaN

In [18]:
print (frame2)
print ("---")
print(frame2.values)

       year   state  pop  debt  eastern
one    2000    Ohio  1.5     0     True
two    2001    Ohio  1.7     1     True
three  2002    Ohio  3.6     2     True
four   2001  Nevada  2.4     3    False
five   2002  Nevada  2.9     4    False
six    2003  Nevada  3.2     5    False
---
[[2000 'Ohio' 1.5 0 True]
 [2001 'Ohio' 1.7 1 True]
 [2002 'Ohio' 3.6 2 True]
 [2001 'Nevada' 2.4 3 False]
 [2002 'Nevada' 2.9 4 False]
 [2003 'Nevada' 3.2 5 False]]

In [19]:
'state' in frame2.columns
'three' in frame2.index

True

# Essential Functionality #

**Reindexing**

In [20]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print (obj)
print ("----")
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
print (obj)
print ("----")
print (obj2)

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
----
d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64
----
a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [21]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
print (obj3)
print ("----")
obj3.reindex(range(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object
----

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [22]:
frame = pd.DataFrame(np.arange(9).reshape(3, 3), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
print (frame)
print ("----")
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
print (frame2)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
----
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [23]:
states = ['Texas', 'Utah', 'California']
frame.loc[['a', 'b'], states]
frame.reindex(['a', 'c', 'b'], states)

/Users/shivjaya/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)
/Users/shivjaya/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: FutureWarning: Interpreting call
	'.reindex(a, b)' as
	'.reindex(index=a, columns=b)'.
Use named arguments to remove any ambiguity. In the future, using positional arguments for 'index' or 'columns' will raise  a 'TypeError'.
  This is separate from the ipykernel package so we can avoid doing imports until

   Texas  Utah  California
a    1.0   NaN         2.0
c    4.0   NaN         5.0
b    NaN   NaN         NaN

In [25]:
## Dropping entries from an axis

obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [26]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [27]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [29]:
data = pd.DataFrame(np.arange(16).reshape(4, 4), index=['Ohio', 'Colorado', 'Utah', 'New York'], columns=['one', 'two', 'three', 'four'])

In [30]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [32]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [36]:
data.drop('two', axis=1, inplace=True)
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [37]:
data.drop('Ohio', inplace=True)
data

          one  three  four
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [38]:
## Indexing, Selection and Filtering

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [39]:
obj['b']

1.0

In [40]:
obj[1]

1.0

In [41]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [42]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [43]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [44]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [45]:
obj[obj != 2]

a    0.0
b    1.0
d    3.0
dtype: float64

In [51]:
obj['a':'c']

a    0.0
b    1.0
c    2.0
dtype: float64

In [52]:
data = pd.DataFrame(np.arange(16).reshape(4, 4), index=['Ohio', 'Colorado', 'Utah', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [53]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [56]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [61]:
data[0:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [65]:
print (data)
print ("---")
data[data['three'] != 6]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15
---

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [67]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data.loc[['Ohio', 'Colorado']]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [88]:
x = data.loc['Colorado']
print (type(x))
x

<class 'pandas.core.series.Series'>

one      4
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [90]:
data.iloc[[0, 1], [0, 2]]

          one  three
Ohio        0      2
Colorado    4      6

In [97]:
d = pd.DataFrame(np.arange(12).reshape(3, 4), index=['Utah', 'CA', 'NY'], columns = ['one', 'two', 'three', 'four'])
print (d)
d - d.loc['Utah']

      one  two  three  four
Utah    0    1      2     3
CA      4    5      6     7
NY      8    9     10    11

      one  two  three  four
Utah    0    0      0     0
CA      4    4      4     4
NY      8    8      8     8

In [ ]:
## sorting and ranking